https://www.tutorialspoint.com/python_pandas/python_pandas_basic_functionality.htm

In [ ]:
Data Structure:
Series	1	1D labeled homogeneous array, sizeimmutable.
Data Frames	2	General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.
Panel	3	General 3D labeled, size-mutable array.

In [2]:
import pandas as pd
list1 = [1,2,3,4,5,6]
df = pd.Series(list1, index = ['a','b','c','d','e','f'])
df

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [3]:
list2 = {'a' : 0., 'e' : 1., 'c' : 2.}
df = pd.Series(list2)
df

a    0.0
b    1.0
c    2.0
dtype: float64

In [8]:
df = pd.Series(list2, index=['a','b','c','d','e','f'])
df

a    0.0
b    1.0
c    2.0
d    NaN
e    NaN
f    NaN
dtype: float64

In [7]:
df = pd.Series(3,index=['a','b','c','d','e','f'])
df

a    3
b    3
c    3
d    3
e    3
f    3
dtype: int64

In [13]:
df[[1,2,3]]
#df[['a','d']]

b    1.0
c    2.0
d    NaN
dtype: float64

### Features of DataFrame
Potentially columns are of different types
Size – Mutable
Labeled axes (rows and columns)
Can Perform Arithmetic operations on rows and columns
pandas.DataFrame( data, index, columns, dtype, copy)

In [21]:
list3 = [['Alex',10],['Bob',12],['Clarke',13]]
list4 = {'name': ['a','b','c'], 'age': [11,14,18]}

In [20]:
pd.DataFrame(list3, columns=['name','age'], dtype=float)

     name   age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [23]:
pd.DataFrame(list4, index=[3,4,5], dtype=float)

  name   age
3    a  11.0
4    b  14.0
5    c  18.0

In [39]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']),
    'three' : pd.Series([34,23,34,45], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

In [40]:
df['new'] = df['two']+df['three']
df

   one  two  three  new
a  1.0    1     34   35
b  2.0    2     23   25
c  3.0    3     34   37
d  NaN    4     45   49

In [35]:
del df['new']
df

   one  two  three
a  1.0    1     34
b  2.0    2     23
c  3.0    3     34
d  NaN    4     45

In [37]:
df.pop('one')
df

   two  three
a    1     34
b    2     23
c    3     34
d    4     45

In [44]:
# Row Selection
df.loc['a':'c']

   one  two  three  new
a  1.0    1     34   35
b  2.0    2     23   25
c  3.0    3     34   37

In [45]:
df.iloc[1:3]

   one  two  three  new
b  2.0    2     23   25
c  3.0    3     34   37

In [46]:
# Addition of row or Row Append
df = df.append(df.iloc[2:3])
df

   one  two  three  new
a  1.0    1     34   35
b  2.0    2     23   25
c  3.0    3     34   37
d  NaN    4     45   49
c  3.0    3     34   37

In [49]:
#deletion of row
df = df.drop('a')
df

   one  two  three  new
b  2.0    2     23   25
c  3.0    3     34   37
d  NaN    4     45   49
c  3.0    3     34   37

In [54]:
import numpy as np
ss = pd.Series(np.random.randn(5))
ss

0   -0.425550
1   -0.343918
2    1.157644
3   -0.477285
4    1.795036
dtype: float64

In [56]:
print(ss.axes)
print(ss.empty)

[RangeIndex(start=0, stop=5, step=1)]
False

In [57]:
df.size

16

In [58]:
df.values

array([[ 2.,  2., 23., 25.],
       [ 3.,  3., 34., 37.],
       [nan,  4., 45., 49.],
       [ 3.,  3., 34., 37.]])

In [59]:
df.tail(2)

   one  two  three  new
d  NaN    4     45   49
c  3.0    3     34   37

In [60]:
df.T

          b     c     d     c
one     2.0   3.0   NaN   3.0
two     2.0   3.0   4.0   3.0
three  23.0  34.0  45.0  34.0
new    25.0  37.0  49.0  37.0

In [63]:
print(df.dtypes)
print(df.empty)

one      float64
two        int64
three      int64
new        int64
dtype: object
False

In [66]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}
df = pd.DataFrame(d)
print(df)
print(df.size)
print(df.shape)
print(df.values)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80
21
(7, 3)
[['Tom' 25 4.23]
 ['James' 26 3.24]
 ['Ricky' 25 3.98]
 ['Vin' 23 2.56]
 ['Steve' 30 3.2]
 ['Smith' 29 4.6]
 ['Jack' 23 3.8]]

In [67]:
# By default, axis is index (axis=0).
df.sum()
# sum of column

Name      TomJamesRickyVinSteveSmithJack
Age                                  181
Rating                             25.61
dtype: object

In [68]:
df.sum(axis=1)
#sum of row

0    29.23
1    29.24
2    28.98
3    25.56
4    33.20
5    33.60
6    26.80
dtype: float64

In [71]:
df.sum(1)
# row level sum

0    29.23
1    29.24
2    28.98
3    25.56
4    33.20
5    33.60
6    26.80
dtype: float64

In [74]:
df.mean()
#df.mean(1) # for row level mean

Age       25.857143
Rating     3.658571
dtype: float64

In [76]:
df.std(1) # row level std
#df.std() # column level std

0    14.686608
1    16.093750
2    14.863385
3    14.453263
4    18.950462
5    17.253405
6    13.576450
dtype: float64

# count(), mean(), median(), sum(), mode(), std(), min(), max(), abd(), prod(), cumsum(), cumprod()

In [77]:
df.describe()

             Age    Rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000

In [79]:
df.describe(include=['object'])

         Name
count       7
unique      7
top     Smith
freq        1

In [80]:
df.describe(include='all')

         Name        Age    Rating
count       7   7.000000  7.000000
unique      7        NaN       NaN
top     Smith        NaN       NaN
freq        1        NaN       NaN
mean      NaN  25.857143  3.658571
std       NaN   2.734262  0.698628
min       NaN  23.000000  2.560000
25%       NaN  24.000000  3.220000
50%       NaN  25.000000  3.800000
75%       NaN  27.500000  4.105000
max       NaN  30.000000  4.600000

Function Application
>Table wise Function Application: pipe()
>Row or Column Wise Function Application: apply()
>Element wise Function Application: applymap()

In [ ]:
def add_func(a,b):
    return a+b

df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
add_func()

In [83]:
df1 = df.reindex(index=[4,3,2,1,5,6,7])
df1

    Name   Age  Rating
4  Steve  30.0    3.20
3    Vin  23.0    2.56
2  Ricky  25.0    3.98
1  James  26.0    3.24
5  Smith  29.0    4.60
6   Jack  23.0    3.80
7    NaN   NaN     NaN

In [84]:
df1.reindex_like(df)

    Name   Age  Rating
0    NaN   NaN     NaN
1  James  26.0    3.24
2  Ricky  25.0    3.98
3    Vin  23.0    2.56
4  Steve  30.0    3.20
5  Smith  29.0    4.60
6   Jack  23.0    3.80

In [89]:
df1 = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])
df2.reindex_like(df1, method='ffill',limit=1)

       col1      col2      col3
0 -0.568754  0.829597 -0.743854
1 -0.223793  3.484335 -0.765421
2 -0.223793  3.484335 -0.765421
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN

In [92]:
df1.rename(columns={'col1':'c1', 'col2':'c2'}, index={0:'aa',3:'bb'})

          c1        c2      col3
aa -0.633666  1.476036 -0.126775
1  -0.701642 -0.104916  0.095532
2  -0.033354 -0.266239  2.042879
bb -1.873767  0.371604  0.337398
4   0.010622 -0.621645  1.877616
5  -0.651549 -0.157455  0.572358

In [ ]:
# https://www.tutorialspoint.com/python_pandas/python_pandas_iteration.htm

To iterate over the rows of the DataFrame, we can use the following functions −

iteritems() − to iterate over the (key,value) pairs
iterrows() − iterate over the rows as (index,series) pairs
itertuples() − iterate over the rows as namedtuples

In [94]:
df = pd.DataFrame(np.random.randn(4,3), columns=['col1','col2','col3'])
for key, value in df.iteritems():
    print(key, value)

col1 0    0.494796
1   -1.095339
2   -1.243291
3   -0.573382
Name: col1, dtype: float64
col2 0    0.761345
1   -0.132331
2   -0.463775
3   -0.285023
Name: col2, dtype: float64
col3 0    1.333369
1   -0.156707
2   -0.452710
3    0.191673
Name: col3, dtype: float64

In [95]:
for index,row in df.iterrows():
    print(index,row)

0 col1    0.494796
col2    0.761345
col3    1.333369
Name: 0, dtype: float64
1 col1   -1.095339
col2   -0.132331
col3   -0.156707
Name: 1, dtype: float64
2 col1   -1.243291
col2   -0.463775
col3   -0.452710
Name: 2, dtype: float64
3 col1   -0.573382
col2   -0.285023
col3    0.191673
Name: 3, dtype: float64

In [96]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, col1=0.49479590032549026, col2=0.761345101124832, col3=1.3333691662706688)
Pandas(Index=1, col1=-1.0953389399436135, col2=-0.13233087958880754, col3=-0.15670696512110968)
Pandas(Index=2, col1=-1.2432909164207953, col2=-0.46377524313820256, col3=-0.4527095742548826)
Pandas(Index=3, col1=-0.5733822392585816, col2=-0.28502252612807005, col3=0.19167325872262672)

In [105]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randn(5,2),columns=['col1','col2'], index=[2,4,1,3,5])
df.sort_index()

       col1      col2
1 -0.320074 -1.135476
2 -1.492503  0.089391
3  0.615075  0.672405
4  0.650532  0.576450
5  0.100750  0.376811

In [104]:
axis 0 for row and 1 for column
df.sort_index(axis=1)

       col1      col2
2 -0.170744  0.615331
4 -1.292098  1.186518
1  0.703735  0.594688
3  0.402556  0.727951
5 -0.212262  1.274576

In [107]:
df.sort_values(by='col1')

       col1      col2
2 -1.492503  0.089391
1 -0.320074 -1.135476
5  0.100750  0.376811
3  0.615075  0.672405
4  0.650532  0.576450

In [109]:
df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
df.sort_values(by=['col1','col2'])

   col1  col2
2     1     2
1     1     3
3     1     4
0     2     1

In [111]:
#Converts strings in the Series/Index to lower case.
s = pd.Series(['Tom', 'William Rick', 'John', 'Alber@t', np.nan, '1234','SteveSmith'])
s.str.lower()

0             tom
1    william rick
2            john
3         alber@t
4             NaN
5            1234
6      stevesmith
dtype: object

In [112]:
#Converts strings in the Series/Index to upper case.
s.str.upper()

0             TOM
1    WILLIAM RICK
2            JOHN
3         ALBER@T
4             NaN
5            1234
6      STEVESMITH
dtype: object

In [115]:
#Computes String length()
s.str.len()

0     3.0
1    12.0
2     4.0
3     7.0
4     NaN
5     4.0
6    10.0
dtype: float64

In [116]:
# Helps strip whitespace(including newline) from each string in the Series/index from both the sides.
s1 = pd.Series(['Tom ', ' William Rick', 'John', 'Alber@t'])
s1.str.strip()

0             Tom
1    William Rick
2            John
3         Alber@t
dtype: object

In [117]:
# Splits each string with the given pattern.
s1.str.split(" ")

0              [Tom, ]
1    [, William, Rick]
2               [John]
3            [Alber@t]
dtype: object

In [ ]:
# Concatenates the series/index elements with given separator.

In [119]:
s1.str.cat(sep="**")

'Tom ** William Rick**John**Alber@t'

In [125]:
# Returns the DataFrame with One-Hot Encoded values.
s.str.get_dummies()

   1234  Alber@t  John  SteveSmith  Tom  William Rick
0     0        0     0           0    1             0
1     0        0     0           0    0             1
2     0        0     1           0    0             0
3     0        1     0           0    0             0
4     0        0     0           0    0             0
5     1        0     0           0    0             0
6     0        0     0           1    0             0

In [127]:
# turns a Boolean value True for each element if the substring contains in the element, else False.
s.str.contains(" ")

0    False
1     True
2    False
3    False
4      NaN
5    False
6    False
dtype: object

In [128]:
# Replaces the value a with the value b.
s.str.replace(' ','#')

0             Tom
1    William#Rick
2            John
3         Alber@t
4             NaN
5            1234
6      SteveSmith
dtype: object

In [133]:
# Label based
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

df.loc[:,'A']

a   -0.912787
b   -1.931380
c   -0.784989
d    0.423184
e    1.182845
f   -0.180615
g    1.218363
h    1.327701
Name: A, dtype: float64

In [136]:
df.loc['a':'f',['A','D']]

          A         D
a -0.912787 -1.267768
b -1.931380 -0.255082
c -0.784989  0.453816
d  0.423184  0.559617
e  1.182845 -0.241993
f -0.180615 -0.409354

In [137]:
df.loc[['a','b','f','h'],['A','C']]

          A         C
a -0.912787  0.388025
b -1.931380  0.721850
f -0.180615 -1.507530
h  1.327701 -1.101359

In [138]:
df.loc['a':'g']

          A         B         C         D
a -0.912787 -0.620191  0.388025 -1.267768
b -1.931380 -0.814651  0.721850 -0.255082
c -0.784989 -0.565719 -1.509518  0.453816
d  0.423184  0.768669 -0.289531  0.559617
e  1.182845  0.325046  1.077709 -0.241993
f -0.180615  0.906993 -1.507530 -0.409354
g  1.218363 -0.612294  0.601674 -0.411760

In [139]:
df.loc['a']>0

A    False
B    False
C     True
D    False
Name: a, dtype: bool

In [140]:
# Integer based
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])
df.iloc[:4]

          A         B         C         D
0 -1.067977  0.491543 -0.750465 -0.013328
1  1.769245 -0.603851 -0.622708 -0.655130
2  0.133740  1.391896 -0.327606 -2.174603
3  0.612308  1.518120 -0.294692 -0.544224

In [144]:
df.iloc[1:4,2:4]

          C         D
1 -0.622708 -0.655130
2 -0.327606 -2.174603
3 -0.294692 -0.544224

In [145]:
df.iloc[[1,2,3],[2,3]]

          C         D
1 -0.622708 -0.655130
2 -0.327606 -2.174603
3 -0.294692 -0.544224

In [146]:
df.iloc[:,[1,2]]

          B         C
0  0.491543 -0.750465
1 -0.603851 -0.622708
2  1.391896 -0.327606
3  1.518120 -0.294692
4  1.744994 -0.173634
5  0.961903  0.706744
6  1.565202 -0.751350
7 -2.585168 -0.180269

In [150]:
df[['A','B']]

          A         B
0 -1.067977  0.491543
1  1.769245 -0.603851
2  0.133740  1.391896
3  0.612308  1.518120
4  0.629016  1.744994
5  0.532185  0.961903
6  0.294109  1.565202
7 -0.237870 -2.585168

In [151]:
df[2:2]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [152]:
df.A

0   -1.067977
1    1.769245
2    0.133740
3    0.612308
4    0.629016
5    0.532185
6    0.294109
7   -0.237870
Name: A, dtype: float64

In [153]:
df = pd.DataFrame(np.random.randn(5,3))
df.pct_change()

          0         1         2
0       NaN       NaN       NaN
1 -0.684366  3.422302 -0.617144
2 -2.407297 -0.772744  0.758554
3 -0.445266  6.340802 -0.287337
4  2.439353 -0.921099  3.636014

In [154]:
df.pct_change(axis=1)

    0          1          2
0 NaN  -0.607662  -3.800474
1 NaN   4.496986  -1.242448
2 NaN  -1.887674  -2.876117
3 NaN -12.746596  -1.182138
4 NaN  -1.269476 -11.701901

In [160]:
# Covariance 
df2 = pd.DataFrame(np.random.randn(5,3))
df2.cov()

          0         1         2
0  1.066417  0.189311  0.124731
1  0.189311  0.525330 -0.151224
2  0.124731 -0.151224  0.730839

In [161]:
# Correlation shows the linear relationship
df2.corr()

          0         1         2
0  1.000000  0.252927  0.141286
1  0.252927  1.000000 -0.244059
2  0.141286 -0.244059  1.000000

In [166]:
df2.rank()

     0    1    2
0  3.0  5.0  3.0
1  1.0  1.0  4.0
2  5.0  2.0  5.0
3  2.0  3.0  1.0
4  4.0  4.0  2.0

In [168]:
# .rolling() Function (Check .expanding() Function and .ewm() Function)
# This function can be applied on a series of data. Specify the window=n argument and 
# apply the appropriate statistical function on top of it.

df = pd.DataFrame(np.random.randn(7,4), columns=['A','B','C','D'])
df.rolling(window=3).mean()

          A         B         C         D
0       NaN       NaN       NaN       NaN
1       NaN       NaN       NaN       NaN
2  0.975068  0.485891 -0.619573 -0.688960
3  0.844332  0.536876 -1.073309 -0.444697
4  0.658037  0.832403 -0.838793 -0.494956
5  0.112678  0.561172 -1.134374  0.108418
6  0.600412  0.473494 -0.650197 -0.440581

In [169]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f',
'h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df.isnull()
#df['one'].isnull()

     one    two  three
a  False  False  False
b   True   True   True
c  False  False  False
d   True   True   True
e  False  False  False
f  False  False  False
g   True   True   True
h  False  False  False

In [170]:
df.notnull()

     one    two  three
a   True   True   True
b  False  False  False
c   True   True   True
d  False  False  False
e   True   True   True
f   True   True   True
g  False  False  False
h   True   True   True

In [171]:
df.isnull().sum()
#df['one'].isnull().sum()

one      3
two      3
three    3
dtype: int64

In [173]:
df.sum()
# df['one'].sum()

one     -3.025921
two     -2.305078
three    1.190850
dtype: float64

In [176]:
# replace NaN value with 0 (zero)
df.fillna(0)

        one       two     three
a -2.258833  0.500680  1.759362
b  0.000000  0.000000  0.000000
c -1.335981 -0.605028 -1.105290
d  0.000000  0.000000  0.000000
e  0.993103 -0.175264  0.701147
f -1.018396 -1.564963 -0.969750
g  0.000000  0.000000  0.000000
h  0.594185 -0.460502  0.805381

In [178]:
# pad/ffill : Fill methods Forward
df.fillna(method='pad')
# df.fillna(method='ffill')

        one       two     three
a -2.258833  0.500680  1.759362
b -2.258833  0.500680  1.759362
c -1.335981 -0.605028 -1.105290
d -1.335981 -0.605028 -1.105290
e  0.993103 -0.175264  0.701147
f -1.018396 -1.564963 -0.969750
g -1.018396 -1.564963 -0.969750
h  0.594185 -0.460502  0.805381

In [181]:
# Fill methods Backward
df.fillna(method='backfill')
# df.fillna(method='bfill')

        one       two     three
a -2.258833  0.500680  1.759362
b -1.335981 -0.605028 -1.105290
c -1.335981 -0.605028 -1.105290
d  0.993103 -0.175264  0.701147
e  0.993103 -0.175264  0.701147
f -1.018396 -1.564963 -0.969750
g  0.594185 -0.460502  0.805381
h  0.594185 -0.460502  0.805381

In [183]:
df.dropna()

        one       two     three
a -2.258833  0.500680  1.759362
c -1.335981 -0.605028 -1.105290
e  0.993103 -0.175264  0.701147
f -1.018396 -1.564963 -0.969750
h  0.594185 -0.460502  0.805381

In [184]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

In [185]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
df.replace({1000:101,2000:202})

   one  two
0   10  101
1   20    0
2   30   30
3   40   40
4   50   50
5  202   60

In [188]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df.groupby('Team')

In [189]:
df.groupby('Team').groups
# df.groupby(['Team','Year']).groups

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

In [190]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10], ('kings', 2015): [5]}

In [192]:
for name,group in df.groupby('Year'):
    print(name)
    print(group)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [194]:
df.groupby('Year').get_group(2015)

      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804

In [197]:
df1 = df.groupby('Year')
df1['Points'].agg(np.mean)
#df.groupby('Year')['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [199]:
df.groupby('Team').agg(np.size)

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [201]:
df1 = df.groupby('Team')
df1['Points'].agg([np.sum,np.mean,np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

In [204]:
score = lambda x : (x - x.mean()) / x.std()*10
df1.transform(score)

         Rank       Year     Points
0  -15.000000 -11.618950  12.843272
1    5.000000  -3.872983   3.020286
2   -7.071068  -7.071068   7.071068
3    7.071068   7.071068  -7.071068
4   11.547005 -10.910895  -8.608621
5         NaN        NaN        NaN
6   -5.773503   2.182179  -2.360428
7   -5.773503   8.728716  10.969049
8    5.000000   3.872983  -7.705963
9    7.071068  -7.071068  -7.071068
10  -7.071068   7.071068   7.071068
11   5.000000  11.618950  -8.157595

In [205]:
df.groupby('Team').filter(lambda x: len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690